.org/tasks.org
#+TITLE: 任务



* 2019年6月5日

使用 Java/JS/C# 实现一个函数，模拟命令行下敲入命令之后，系统的处理:
- 比如名字 ~getFilenameFromCmd(currentDir, command)~
- 返回命令相对应的执行文件，可能是 ~.bat/.exe/.cmd~ 格式
- 如果命令没有找到对应文件，则报错

提示:
#+BEGIN_SRC java
  public class Main {
      public static void main(String[] args) {
          System.out.println(System.getenv("PATH"));
      }
  }
#+END_SRC

步骤:
1. *分析问题*，题目要求要做什么事
2. 借助流程图，展现自己分析的结果
3. *解决问题*，选择一门语言，将自己的分析思路实现出来


可以借助 TDD 的方式，进行思路的梳理跟问题的解决:
#+BEGIN_SRC js
  function getPathforCmd (cwd, cmd) {

    
      return "cmd 所对应的那个可执行文件";
  }

  // TDD (Test Driven Development) 测试驱动开发
  function test1 () {
      var t1 = getPathforCmd("c:/", "sqlite3") == "e:/xxx/sqlite3.exe";
      var t2 = getPathforCmd("c:/", "sqlite4") == "";
      var t3 = getPathforCmd("c:/", "d:/sqlite4") == "";
      var t4 = getPathforCmd("c:/test", "sqlite3") == "c:/test/sqlite3.bat";
      var t5 = getPathforCmd("c:/test", "d:/sqlite3") == "d:/sqlite3.bat";

      if (t1 && t2 && t3 && t4 && t5) {
          console.log("测试通过");
      }
  }

#+END_SRC

* 2019年6月4日

用 sqlite 为 “我的书单” 应用，创建数据库表。

提示:
- book
- author
- category
- tag

* 2019年1月1日（清明节作业）

- 初步任务 ::
          读取某个文件夹下所有的文件，然后将其重命名：

          + aaa.jpg  → aaa_20190102.jpg // 如果是照片，读取 EXIF 中的创建日期。考查文件的操作，考查字符串操作
          + 已经是上述格式的话跳过修改    // 考查正则匹配知识

- 进阶任务 ::

          改完名字之后，将所有文件打包成一个压缩文件（rar/zip） // 考查IO流及压缩的基本知识

- 额外任务 ::

          将这个压缩文件通过 JAVA 发送邮件的方式，发给 yaowuer@qq.com  //考查邮件发送的基本知识


提示:
1. 如何读取一个文件夹下的所有文件
2. 如何将其重命名
3. 如何将一个文件打包成压缩文件
4. 如何发送这个压缩文件

