tasks.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-06-10 周一 06:40 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>任务</title>
<meta name="generator" content="Org mode">
<meta name="author" content="yaowuer">
<link rel='stylesheet' href='/asset/common.css' />



</head>
<body>
<div id="content">
<header>
<h1 class="title">任务</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org986ab2e">1. 2019年6月5日</a></li>
<li><a href="#org0c65a74">2. 2019年6月4日</a></li>
<li><a href="#org909142e">3. 2019年1月1日（清明节作业）</a></li>
</ul>
</div>
</nav>



<section id="outline-container-org986ab2e" class="outline-2">
<h2 id="org986ab2e"><span class="section-number-2">1</span> 2019年6月5日</h2>
<div class="outline-text-2" id="text-1">
<p>
使用 Java/JS/C# 实现一个函数，模拟命令行下敲入命令之后，系统的处理:
</p>
<ul class="org-ul">
<li>比如名字 <code>getFilenameFromCmd(currentDir, command)</code></li>
<li>返回命令相对应的执行文件，可能是 <code>.bat/.exe/.cmd</code> 格式</li>
<li>如果命令没有找到对应文件，则报错</li>
</ul>

<p>
提示:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Main</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        System.out.println(System.getenv(<span class="org-string">"PATH"</span>));
    }
}
</pre>
</div>

<p>
步骤:
</p>
<ol class="org-ol">
<li><b>分析问题</b>，题目要求要做什么事</li>
<li>借助流程图，展现自己分析的结果</li>
<li><b>解决问题</b>，选择一门语言，将自己的分析思路实现出来</li>
</ol>


<p>
可以借助 TDD 的方式，进行思路的梳理跟问题的解决:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">getPathforCmd</span> (<span class="org-variable-name">cwd</span>, <span class="org-variable-name">cmd</span>) {


    <span class="org-keyword">return</span> <span class="org-string">"cmd &#25152;&#23545;&#24212;&#30340;&#37027;&#20010;&#21487;&#25191;&#34892;&#25991;&#20214;"</span>;
}

<span class="org-comment-delimiter">// </span><span class="org-comment">TDD (Test Driven Development) &#27979;&#35797;&#39537;&#21160;&#24320;&#21457;</span>
<span class="org-keyword">function</span> <span class="org-function-name">test1</span> () {
    <span class="org-keyword">var</span> <span class="org-variable-name">t1</span> = getPathforCmd(<span class="org-string">"c:/"</span>, <span class="org-string">"sqlite3"</span>) == <span class="org-string">"e:/xxx/sqlite3.exe"</span>;
    <span class="org-keyword">var</span> <span class="org-variable-name">t2</span> = getPathforCmd(<span class="org-string">"c:/"</span>, <span class="org-string">"sqlite4"</span>) == <span class="org-string">""</span>;
    <span class="org-keyword">var</span> <span class="org-variable-name">t3</span> = getPathforCmd(<span class="org-string">"c:/"</span>, <span class="org-string">"d:/sqlite4"</span>) == <span class="org-string">""</span>;
    <span class="org-keyword">var</span> <span class="org-variable-name">t4</span> = getPathforCmd(<span class="org-string">"c:/test"</span>, <span class="org-string">"sqlite3"</span>) == <span class="org-string">"c:/test/sqlite3.bat"</span>;
    <span class="org-keyword">var</span> <span class="org-variable-name">t5</span> = getPathforCmd(<span class="org-string">"c:/test"</span>, <span class="org-string">"d:/sqlite3"</span>) == <span class="org-string">"d:/sqlite3.bat"</span>;

    <span class="org-keyword">if</span> (t1 &amp;&amp; t2 &amp;&amp; t3 &amp;&amp; t4 &amp;&amp; t5) {
        console.log(<span class="org-string">"&#27979;&#35797;&#36890;&#36807;"</span>);
    }
}

</pre>
</div>
</div>
</section>

<section id="outline-container-org0c65a74" class="outline-2">
<h2 id="org0c65a74"><span class="section-number-2">2</span> 2019年6月4日</h2>
<div class="outline-text-2" id="text-2">
<p>
用 sqlite 为 “我的书单” 应用，创建数据库表。
</p>

<p>
提示:
</p>
<ul class="org-ul">
<li>book</li>
<li>author</li>
<li>category</li>
<li>tag</li>
</ul>
</div>
</section>

<section id="outline-container-org909142e" class="outline-2">
<h2 id="org909142e"><span class="section-number-2">3</span> 2019年1月1日（清明节作业）</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt>初步任务</dt><dd>读取某个文件夹下所有的文件，然后将其重命名：

<ul class="org-ul">
<li>aaa.jpg  → aaa_20190102.jpg // 如果是照片，读取 EXIF 中的创建日期。考查文件的操作，考查字符串操作</li>
<li>已经是上述格式的话跳过修改    // 考查正则匹配知识</li>
</ul></dd>

<dt>进阶任务</dt><dd>改完名字之后，将所有文件打包成一个压缩文件（rar/zip） // 考查IO流及压缩的基本知识</dd>

<dt>额外任务</dt><dd>将这个压缩文件通过 JAVA 发送邮件的方式，发给 yaowuer@qq.com  //考查邮件发送的基本知识</dd>
</dl>


<p>
提示:
</p>
<ol class="org-ol">
<li>如何读取一个文件夹下的所有文件</li>
<li>如何将其重命名</li>
<li>如何将一个文件打包成压缩文件</li>
<li>如何发送这个压缩文件</li>
</ol>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: yaowuer</p>
<p class="date">Created: 2019-06-10 周一 06:40</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
